#pragma once
#ifndef __IM_FLIP_H
#define __IM_FLIP_H
#include "BmpTypeDef.h"
#include "TypeDef.h"
/*******************************************************************************
* 函数名   : ImFlipY
* 描  述   : 图像Y轴翻转
* 输  入   : 
		     pBmp ：Bmp结构体对象指针
* 输  出   :  
* 返回值   : Bmp*，NULL：失败；！NULL:成功。
*******************************************************************************/
Bmp*  ImFlipY(Bmp* pBmp);
/*******************************************************************************
* 函数名   : ImFlipX
* 描  述   : 图像X轴翻转
* 输  入   : 
		     pBmp ：Bmp结构体对象指针
* 输  出   :  
* 返回值   : Bmp*，NULL：失败；！NULL:成功。
*******************************************************************************/
Bmp*  ImFlipX(Bmp* pBmp);
#endif